TexasInstruments/motor-control-sdk/examples/position_sense/nikon_diagnostic/dual_channel/am261x-lp/r5fss0-0_freertos/example.syscfg
nikon2.$name                               = "CONFIG_NIKON1";
nikon2.Booster_Pack                        = true;
nikon2.protocolVersion                     = 3;
nikon2.CMP_Event_Num                       = 3;
nikon2.CAP_Event_Num                       = 7;
nikon2.ENC0_EN.$name                       = "NIKON1_BP_POWER_EN0";
nikon2.ENC0_EN.GPIO_n.$assign              = "GPIO22";
nikon2["PRU-ICSS1"].$assign                = "PRU-ICSS1";
nikon2["PRU-ICSS1"].PR1_PRU1_GPIO2.$assign = "GPIO73";
nikon2["PRU-ICSS1"].PR1_PRU1_GPIO1.$assign = "GPIO72";
nikon2["PRU-ICSS1"].PR1_PRU1_GPIO0.$assign = "GPIO71";
nikon2["PRU-ICSS1"].PR1_PRU1_GPIO9.$assign = "GPIO74";

pruicss1.$name                           = "CONFIG_PRU_ICSS0";
nikon1.pru                               = pruicss1;
nikon2.pru                               = pruicss1;
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";
pruicss1.intcMapping.create(2);
pruicss1.intcMapping[0].$name            = "CONFIG_ICSS1_INTC_MODE1_MAPPING0";
pruicss1.intcMapping[0].event            = "21";
pruicss1.intcMapping[1].$name            = "CONFIG_ICSS1_INTC_MODE1_MAPPING1";
pruicss1.intcMapping[1].channel          = "3";
pruicss1.intcMapping[1].event            = "18";

epwm_syncout_xbar1.$name      = "CONFIG_EPWM_SYNCOUT_XBAR0";
epwm_syncout_xbar1.xbarOutput = ["EPWM0_SYNCOUT"];

soc_timesync_xbar11.$name      = "CONFIG_SOC_TIMESYNC_XBAR1_0";
soc_timesync_xbar11.xbarOutput = "SOC_TIMESYNC_XBAR1_PWM_SYNCOUT_XBAR_OUT_0";
soc_timesync_xbar11.instance   = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_0";

soc_timesync_xbar12.$name      = "CONFIG_SOC_TIMESYNC_XBAR1_1";
soc_timesync_xbar12.xbarOutput = "SOC_TIMESYNC_XBAR1_PWM_SYNCOUT_XBAR_OUT_0";
soc_timesync_xbar12.instance   = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_1";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution = "GPIO43";
epwm1.EPWM.B.$suggestSolution = "GPIO44";
